CSI API ETABS v1
cAnalysisResults.AreaStrainShell Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AreaStrainShell(
	string Name,
	eItemTypeElm ItemTypeElm,
	ref int NumberResults,
	ref string[] obj,
	ref string[] elm,
	ref string[] PointElm,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] e11top,
	ref double[] e22top,
	ref double[] g12top,
	ref double[] emaxtop,
	ref double[] emintop,
	ref double[] eangletop,
	ref double[] evmtop,
	ref double[] e11bot,
	ref double[] e22bot,
	ref double[] g12bot,
	ref double[] emaxbot,
	ref double[] eminbot,
	ref double[] eanglebot,
	ref double[] evmbot,
	ref double[] g13avg,
	ref double[] g23avg,
	ref double[] gmaxavg,
	ref double[] gangleavg
)
Function AreaStrainShell (
	Name As String,
	ItemTypeElm As eItemTypeElm,
	ByRef NumberResults As Integer,
	ByRef obj As String(),
	ByRef elm As String(),
	ByRef PointElm As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef e11top As Double(),
	ByRef e22top As Double(),
	ByRef g12top As Double(),
	ByRef emaxtop As Double(),
	ByRef emintop As Double(),
	ByRef eangletop As Double(),
	ByRef evmtop As Double(),
	ByRef e11bot As Double(),
	ByRef e22bot As Double(),
	ByRef g12bot As Double(),
	ByRef emaxbot As Double(),
	ByRef eminbot As Double(),
	ByRef eanglebot As Double(),
	ByRef evmbot As Double(),
	ByRef g13avg As Double(),
	ByRef g23avg As Double(),
	ByRef gmaxavg As Double(),
	ByRef gangleavg As Double()
) As Integer
Dim instance As cAnalysisResults
Dim Name As String
Dim ItemTypeElm As eItemTypeElm
Dim NumberResults As Integer
Dim obj As String()
Dim elm As String()
Dim PointElm As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim e11top As Double()
Dim e22top As Double()
Dim g12top As Double()
Dim emaxtop As Double()
Dim emintop As Double()
Dim eangletop As Double()
Dim evmtop As Double()
Dim e11bot As Double()
Dim e22bot As Double()
Dim g12bot As Double()
Dim emaxbot As Double()
Dim eminbot As Double()
Dim eanglebot As Double()
Dim evmbot As Double()
Dim g13avg As Double()
Dim g23avg As Double()
Dim gmaxavg As Double()
Dim gangleavg As Double()
Dim returnValue As Integer
returnValue = instance.AreaStrainShell(Name,
	ItemTypeElm, NumberResults, obj,
	elm, PointElm, LoadCase, StepType,
	StepNum, e11top, e22top, g12top, emaxtop,
	emintop, eangletop, evmtop, e11bot,
	e22bot, g12bot, emaxbot, eminbot,
	eanglebot, evmbot, g13avg, g23avg,
	gmaxavg, gangleavg)
int AreaStrainShell(
	String^ Name,
	eItemTypeElm ItemTypeElm,
	int% NumberResults,
	array<String^>^% obj,
	array<String^>^% elm,
	array<String^>^% PointElm,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% e11top,
	array<double>^% e22top,
	array<double>^% g12top,
	array<double>^% emaxtop,
	array<double>^% emintop,
	array<double>^% eangletop,
	array<double>^% evmtop,
	array<double>^% e11bot,
	array<double>^% e22bot,
	array<double>^% g12bot,
	array<double>^% emaxbot,
	array<double>^% eminbot,
	array<double>^% eanglebot,
	array<double>^% evmbot,
	array<double>^% g13avg,
	array<double>^% g23avg,
	array<double>^% gmaxavg,
	array<double>^% gangleavg
)
abstract AreaStrainShell :
        Name : string *
        ItemTypeElm : eItemTypeElm *
        NumberResults : int byref *
        obj : string[] byref *
        elm : string[] byref *
        PointElm : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        e11top : float[] byref *
        e22top : float[] byref *
        g12top : float[] byref *
        emaxtop : float[] byref *
        emintop : float[] byref *
        eangletop : float[] byref *
        evmtop : float[] byref *
        e11bot : float[] byref *
        e22bot : float[] byref *
        g12bot : float[] byref *
        emaxbot : float[] byref *
        eminbot : float[] byref *
        eanglebot : float[] byref *
        evmbot : float[] byref *
        g13avg : float[] byref *
        g23avg : float[] byref *
        gmaxavg : float[] byref *
        gangleavg : float[] byref -> int
Parameters
Name
Type: System.String
ItemTypeElm
Type: ETABSv1.eItemTypeElm
NumberResults
Type: System.Int32
obj
Type: System.String[]
elm
Type: System.String[]
PointElm
Type: System.String[]
LoadCase
Type: System.String[]
StepType
Type: System.String[]
StepNum
Type: System.Double[]
e11top
Type: System.Double[]
e22top
Type: System.Double[]
g12top
Type: System.Double[]
emaxtop
Type: System.Double[]
emintop
Type: System.Double[]
eangletop
Type: System.Double[]
evmtop
Type: System.Double[]
e11bot
Type: System.Double[]
e22bot
Type: System.Double[]
g12bot
Type: System.Double[]
emaxbot
Type: System.Double[]
eminbot
Type: System.Double[]
eanglebot
Type: System.Double[]
evmbot
Type: System.Double[]
g13avg
Type: System.Double[]
g23avg
Type: System.Double[]
gmaxavg
Type: System.Double[]
gangleavg
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace